# IsEditable Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Workset..::..IsEditable Property
Workset Class See Also
---
Whether the workset is editable.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsEditable { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsEditable As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsEditable {
	bool get ();
}
```

# Remarks
The workset is editable if owned by current user.
# See Also
Workset Class
Autodesk.Revit.DB Namespace